In [3]:
import numpy as np
import pandas as pd

In [4]:
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])
df_olympic_series = pd.DataFrame({'No. of Participating Countries':olympic_series_participation,'Host Cities':olympic_series_country})

In [5]:
df_olympic_series

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      athens
2000                             200      Sydney
1996                             197     Atlanta

In [6]:
df_olympic_series.describe

<bound method NDFrame.describe of       No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      athens
2000                             200      Sydney
1996                             197     Atlanta>

In [7]:
df_olympic_series.head(2)

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing

In [9]:
df_olympic_series.tail(3)

      No. of Participating Countries Host Cities
2004                             201      athens
2000                             200      Sydney
1996                             197     Atlanta

In [10]:
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [11]:
df_olympic_series.columns

Index(['No. of Participating Countries', 'Host Cities'], dtype='object')

In [12]:
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [15]:
df_olympic_series['No. of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of Participating Countries, dtype: int64

In [16]:
df_olympic_series.loc[2012]

No. of Participating Countries       205
Host Cities                       London
Name: 2012, dtype: object

In [17]:
df_olympic_series.iloc[0:2]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing

In [18]:
df_olympic_series.iat[3,1]

'Sydney'

In [19]:
df_olympic_series[df_olympic_series['No. of Participating Countries']>200]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204     Beijing
2004                             201      athens

In [20]:
first_series = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

In [22]:
second_series = pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])

In [23]:
sum_of_series = first_series+second_series

In [24]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [25]:
dropna_s = sum_of_series.dropna()

In [26]:
dropna_s

c    13.0
e    25.0
dtype: float64

In [27]:
dropna_s.fillna(0)

c    13.0
e    25.0
dtype: float64

In [28]:
fillna_s = sum_of_series.fillna(0)

In [29]:
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [30]:
fill_NaN_with_zeros_before_sum=first_series.add(second_series,fill_value=0)

In [31]:
fill_NaN_with_zeros_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

In [ ]:
#Data operation

In [34]:
df_movie_rating = pd.DataFrame({'movie 1': [5,4,3,3,2,1],'movie 2': [4,5,2,3,4,2]}, index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [35]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [36]:
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    else:
        return 'F'

In [37]:
print(movie_grade(5))

A

In [38]:
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

In [39]:
df_test_scores = pd.DataFrame({'Test1': [95,84,73,88,82,61],
                              'Test2':[74,85,82,73,77,79]},
                             index=['Jack','Lewis','patrick','Rich','Kelly','Paula'])

In [40]:
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [41]:
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [43]:
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

In [45]:
df_president_name = pd.DataFrame({'first':['George','Bill','Jimmy'],'last':['Bush','Clinton','Regan']})

In [46]:
df_president_name

    first     last
0  George     Bush
1    Bill  Clinton
2   Jimmy    Regan

In [58]:
grouped = df_president_name.groupby('first')

In [59]:
grp_data = grouped.get_group('George')
grp_data

    first  last
0  George  Bush

In [60]:
df_president_name.sort_values('last')

    first     last
0  George     Bush
1    Bill  Clinton
2   Jimmy    Regan

In [61]:
def standardize_tests(test):
    return(test-test.mean())/test.std()

In [62]:
standardize_tests(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [63]:
def standardize_test_scores(dataframe):
    return dataframe.apply(standardize_tests)

In [64]:
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

In [65]:
df_student_math = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                               'ID':[10,56,31,85,9,22]})

In [67]:
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],'ID':[10,12,22]})

In [68]:
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

In [69]:
pd.merge(df_student_math,df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [70]:
pd.merge(df_student_math,df_student_science,on='ID',how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [73]:
pd.concat([df_student_math,df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [74]:
pd.concat([df_student_math,df_student_science],ignore_index=False)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
0     Tom  10
1     Ram  12
2   David  22

In [75]:
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'], 'ID':[10,56,10,85,9,56]})

In [76]:
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [77]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [78]:
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [79]:
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [ ]:
#pandas sql operation

In [80]:
import sqlite3

In [81]:
create_table = """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science REAL
);"""

In [84]:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [85]:
SQL_query = executeSQL.execute('select * from student_score')

In [86]:
resulset = SQL_query.fetchall()

In [87]:
resulset

[]

In [88]:
insertSQL = [(10,'Jack',85,92),(29,'Tom',73,89),(65,'Ram',65.5,77),(5,'Steve',55,91)]

In [89]:
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [90]:
SQL_query = executeSQL.execute("select * from student_score")

In [91]:
resulset = SQL_query.fetchall()

In [92]:
resulset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]